tests/files/checkout-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="tns:ns">
<soapenv:Header>
  <tns:CheckOutHeader>
	<MERCHANT_ID>1</MERCHANT_ID>
	<PASSWORD>QjEyREI2QjRGRTlBQUVFOTYyMEVBRjZBRTJGNjMwQUY5QkQ0MjQ5NTRFODk5NDlFRTc2N0Q4M0M1MEZEMDdEQQ==</PASSWORD>
	<TIMESTAMP>20141128174717</TIMESTAMP>
  </tns:CheckOutHeader>
</soapenv:Header>
<soapenv:Body>
  <tns:processCheckOutRequest>
	<MERCHANT_TRANSACTION_ID>911-000</MERCHANT_TRANSACTION_ID>
	<REFERENCE_ID>1112254500</REFERENCE_ID>
	<AMOUNT>54</AMOUNT>
	<MSISDN>2547204871865</MSISDN>
	<!--Optional:-->
	<ENC_PARAMS></ENC_PARAMS>
	<CALL_BACK_URL>http://172.21.20.215:8080/test</CALL_BACK_URL>
	<CALL_BACK_METHOD>xml</CALL_BACK_METHOD>
	<TIMESTAMP>20141128174717</TIMESTAMP>
  </tns:processCheckOutRequest>
</soapenv:Body>
</soapenv:Envelope>